MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256DA110/mcu.h
#define G1CMDH G1CMDH
extern volatile uint16_t G1CMDH __attribute__((__sfr__));
typedef struct tagG1CMDHBITS {
  uint16_t GCMD16:1;
  uint16_t GCMD17:1;
  uint16_t GCMD18:1;
  uint16_t GCMD19:1;
  uint16_t GCMD20:1;
  uint16_t GCMD21:1;
  uint16_t GCMD22:1;
  uint16_t GCMD23:1;
  uint16_t GCMD24:1;
  uint16_t GCMD25:1;
  uint16_t GCMD26:1;
  uint16_t GCMD27:1;
  uint16_t GCMD28:1;
  uint16_t GCMD29:1;
  uint16_t GCMD30:1;
  uint16_t GCMD31:1;
} G1CMDHBITS;
extern volatile G1CMDHBITS G1CMDHbits __attribute__((__sfr__));

#define G1CON1 G1CON1
extern volatile uint16_t G1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagG1CON1BITS {
  union {
    struct {
      uint16_t GCMDCNT:5;
      uint16_t PUBPP:3;
      uint16_t GCMDWMK:5;
      uint16_t G1SIDL:1;
      uint16_t :1;
      uint16_t G1EN:1;
    };
    struct {
      uint16_t GCMDCNT0:1;
      uint16_t GCMDCNT1:1;
      uint16_t GCMDCNT2:1;
      uint16_t GCMDCNT3:1;
      uint16_t GCMDCNT4:1;
      uint16_t PUBPP0:1;
      uint16_t PUBPP1:1;
      uint16_t PUBPP2:1;
      uint16_t GCMDWMK0:1;
      uint16_t GCMDWMK1:1;
      uint16_t GCMDWMK2:1;
      uint16_t GCMDWMK3:1;
      uint16_t GCMDWMK4:1;
    };
  };
} G1CON1BITS;
extern volatile G1CON1BITS G1CON1bits __attribute__((__sfr__));

#define G1STAT G1STAT
extern volatile uint16_t G1STAT __attribute__((__sfr__));
typedef struct tagG1STATBITS {
  uint16_t CMDMPT:1;
  uint16_t CMDFUL:1;
  uint16_t CMDLV:1;
  uint16_t HMRGN:1;
  uint16_t VMRGN:1;
  uint16_t CHRBUSY:1;
  uint16_t RCCBUSY:1;
  uint16_t IPUBUSY:1;
  uint16_t :7;
  uint16_t PUBUSY:1;
} G1STATBITS;
extern volatile G1STATBITS G1STATbits __attribute__((__sfr__));

#define G1IE G1IE
extern volatile uint16_t G1IE __attribute__((__sfr__));
typedef struct tagG1IEBITS {
  uint16_t CMDMPTIE:1;
  uint16_t CMDFULIE:1;
  uint16_t CMDLVIE:1;
  uint16_t HMRGNIE:1;
  uint16_t VMRGNIE:1;
  uint16_t CHRIE:1;
  uint16_t RCCIE:1;
  uint16_t IPUIE:1;
  uint16_t :7;
  uint16_t PUIE:1;
} G1IEBITS;
extern volatile G1IEBITS G1IEbits __attribute__((__sfr__));

#define G1IR G1IR
extern volatile uint16_t G1IR __attribute__((__sfr__));
typedef struct tagG1IRBITS {
  uint16_t CMDMPTIF:1;
  uint16_t CMDFULIF:1;
  uint16_t CMDLVIF:1;
  uint16_t HMRGNIF:1;
  uint16_t VMRGNIF:1;
  uint16_t CHRIF:1;
  uint16_t RCCIF:1;
  uint16_t IPUIF:1;
  uint16_t :7;
  uint16_t PUIF:1;
} G1IRBITS;
extern volatile G1IRBITS G1IRbits __attribute__((__sfr__));

#define G1W1ADRL G1W1ADRL
extern volatile uint16_t G1W1ADRL __attribute__((__sfr__));
typedef struct tagG1W1ADRLBITS {
  uint16_t W1ADR0:1;
  uint16_t W1ADR1:1;
  uint16_t W1ADR2:1;
  uint16_t W1ADR3:1;
  uint16_t W1ADR4:1;
  uint16_t W1ADR5:1;
  uint16_t W1ADR6:1;
  uint16_t W1ADR7:1;
  uint16_t W1ADR8:1;
  uint16_t W1ADR9:1;
  uint16_t W1ADR10:1;
  uint16_t W1ADR11:1;
  uint16_t W1ADR12:1;
  uint16_t W1ADR13:1;
  uint16_t W1ADR14:1;
  uint16_t W1ADR15:1;
} G1W1ADRLBITS;
extern volatile G1W1ADRLBITS G1W1ADRLbits __attribute__((__sfr__));

#define G1W1ADRH G1W1ADRH
extern volatile uint16_t G1W1ADRH __attribute__((__sfr__));
typedef struct tagG1W1ADRHBITS {
  uint16_t W1ADR16:1;
  uint16_t W1ADR17:1;
  uint16_t W1ADR18:1;
  uint16_t W1ADR19:1;
  uint16_t W1ADR20:1;
  uint16_t W1ADR21:1;
  uint16_t W1ADR22:1;
  uint16_t W1ADR23:1;
} G1W1ADRHBITS;
extern volatile G1W1ADRHBITS G1W1ADRHbits __attribute__((__sfr__));

#define G1W2ADRL G1W2ADRL
extern volatile uint16_t G1W2ADRL __attribute__((__sfr__));
typedef struct tagG1W2ADRLBITS {
  uint16_t W2ADR0:1;
  uint16_t W2ADR1:1;
  uint16_t W2ADR2:1;
  uint16_t W2ADR3:1;
  uint16_t W2ADR4:1;
  uint16_t W2ADR5:1;
  uint16_t W2ADR6:1;
  uint16_t W2ADR7:1;
  uint16_t W2ADR8:1;
  uint16_t W2ADR9:1;
  uint16_t W2ADR10:1;
  uint16_t W2ADR11:1;
  uint16_t W2ADR12:1;
  uint16_t W2ADR13:1;
  uint16_t W2ADR14:1;
  uint16_t W2ADR15:1;
} G1W2ADRLBITS;
extern volatile G1W2ADRLBITS G1W2ADRLbits __attribute__((__sfr__));

#define G1W2ADRH G1W2ADRH
extern volatile uint16_t G1W2ADRH __attribute__((__sfr__));
typedef struct tagG1W2ADRHBITS {
  uint16_t W2ADR16:1;
  uint16_t W2ADR17:1;
  uint16_t W2ADR18:1;
  uint16_t W2ADR19:1;
  uint16_t W2ADR20:1;
  uint16_t W2ADR21:1;
  uint16_t W2ADR22:1;
  uint16_t W2ADR23:1;
} G1W2ADRHBITS;
extern volatile G1W2ADRHBITS G1W2ADRHbits __attribute__((__sfr__));

#define G1PUW G1PUW
extern volatile uint16_t G1PUW __attribute__((__sfr__));
__extension__ typedef struct tagG1PUWBITS {
  union {
    struct {
      uint16_t PUW:11;
    };
    struct {
      uint16_t PUW0:1;
      uint16_t PUW1:1;
      uint16_t PUW2:1;
      uint16_t PUW3:1;
      uint16_t PUW4:1;
      uint16_t PUW5:1;
      uint16_t PUW6:1;
      uint16_t PUW7:1;
      uint16_t PUW8:1;
      uint16_t PUW9:1;
      uint16_t PUW10:1;
    };
  };
} G1PUWBITS;
extern volatile G1PUWBITS G1PUWbits __attribute__((__sfr__));

#define G1PUH G1PUH
extern volatile uint16_t G1PUH __attribute__((__sfr__));
__extension__ typedef struct tagG1PUHBITS {
  union {
    struct {
      uint16_t PUH:11;
    };
    struct {
      uint16_t PUH0:1;
      uint16_t PUH1:1;
      uint16_t PUH2:1;
      uint16_t PUH3:1;
      uint16_t PUH4:1;
      uint16_t PUH5:1;
      uint16_t PUH6:1;
      uint16_t PUH7:1;
      uint16_t PUH8:1;
      uint16_t PUH9:1;
      uint16_t PUH10:1;
    };
  };
} G1PUHBITS;
extern volatile G1PUHBITS G1PUHbits __attribute__((__sfr__));

#define G1DPADRL G1DPADRL
extern volatile uint16_t G1DPADRL __attribute__((__sfr__));
typedef struct tagG1DPADRLBITS {
  uint16_t DPADR0:1;
  uint16_t DPADR1:1;
  uint16_t DPADR2:1;
  uint16_t DPADR3:1;
  uint16_t DPADR4:1;
  uint16_t DPADR5:1;
  uint16_t DPADR6:1;
  uint16_t DPADR7:1;
  uint16_t DPADR8:1;
  uint16_t DPADR9:1;
  uint16_t DPADR10:1;
  uint16_t DPADR11:1;
  uint16_t DPADR12:1;
  uint16_t DPADR13:1;
  uint16_t DPADR14:1;
  uint16_t DPADR15:1;
} G1DPADRLBITS;
extern volatile G1DPADRLBITS G1DPADRLbits __attribute__((__sfr__));

#define G1DPADRH G1DPADRH
extern volatile uint16_t G1DPADRH __attribute__((__sfr__));
typedef struct tagG1DPADRHBITS {
  uint16_t DPADR16:1;
  uint16_t DPADR17:1;
  uint16_t DPADR18:1;
  uint16_t DPADR19:1;
  uint16_t DPADR20:1;
  uint16_t DPADR21:1;
  uint16_t DPADR22:1;
  uint16_t DPADR23:1;
} G1DPADRHBITS;
