MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256DA110/mcu.h
#define _G1CMDL_GCMD6_POSITION                   0x00000006
#define _G1CMDL_GCMD6_MASK                       0x00000040
#define _G1CMDL_GCMD6_LENGTH                     0x00000001

#define _G1CMDL_GCMD7_POSITION                   0x00000007
#define _G1CMDL_GCMD7_MASK                       0x00000080
#define _G1CMDL_GCMD7_LENGTH                     0x00000001

#define _G1CMDL_GCMD8_POSITION                   0x00000008
#define _G1CMDL_GCMD8_MASK                       0x00000100
#define _G1CMDL_GCMD8_LENGTH                     0x00000001

#define _G1CMDL_GCMD9_POSITION                   0x00000009
#define _G1CMDL_GCMD9_MASK                       0x00000200
#define _G1CMDL_GCMD9_LENGTH                     0x00000001

#define _G1CMDL_GCMD10_POSITION                  0x0000000A
#define _G1CMDL_GCMD10_MASK                      0x00000400
#define _G1CMDL_GCMD10_LENGTH                    0x00000001

#define _G1CMDL_GCMD11_POSITION                  0x0000000B
#define _G1CMDL_GCMD11_MASK                      0x00000800
#define _G1CMDL_GCMD11_LENGTH                    0x00000001

#define _G1CMDL_GCMD12_POSITION                  0x0000000C
#define _G1CMDL_GCMD12_MASK                      0x00001000
#define _G1CMDL_GCMD12_LENGTH                    0x00000001

#define _G1CMDL_GCMD13_POSITION                  0x0000000D
#define _G1CMDL_GCMD13_MASK                      0x00002000
#define _G1CMDL_GCMD13_LENGTH                    0x00000001

#define _G1CMDL_GCMD14_POSITION                  0x0000000E
#define _G1CMDL_GCMD14_MASK                      0x00004000
#define _G1CMDL_GCMD14_LENGTH                    0x00000001

#define _G1CMDL_GCMD15_POSITION                  0x0000000F
#define _G1CMDL_GCMD15_MASK                      0x00008000
#define _G1CMDL_GCMD15_LENGTH                    0x00000001

#define _G1CMDH_GCMD16_POSITION                  0x00000000
#define _G1CMDH_GCMD16_MASK                      0x00000001
#define _G1CMDH_GCMD16_LENGTH                    0x00000001

#define _G1CMDH_GCMD17_POSITION                  0x00000001
#define _G1CMDH_GCMD17_MASK                      0x00000002
#define _G1CMDH_GCMD17_LENGTH                    0x00000001

#define _G1CMDH_GCMD18_POSITION                  0x00000002
#define _G1CMDH_GCMD18_MASK                      0x00000004
#define _G1CMDH_GCMD18_LENGTH                    0x00000001

#define _G1CMDH_GCMD19_POSITION                  0x00000003
#define _G1CMDH_GCMD19_MASK                      0x00000008
#define _G1CMDH_GCMD19_LENGTH                    0x00000001

#define _G1CMDH_GCMD20_POSITION                  0x00000004
#define _G1CMDH_GCMD20_MASK                      0x00000010
#define _G1CMDH_GCMD20_LENGTH                    0x00000001

#define _G1CMDH_GCMD21_POSITION                  0x00000005
#define _G1CMDH_GCMD21_MASK                      0x00000020
#define _G1CMDH_GCMD21_LENGTH                    0x00000001

#define _G1CMDH_GCMD22_POSITION                  0x00000006
#define _G1CMDH_GCMD22_MASK                      0x00000040
#define _G1CMDH_GCMD22_LENGTH                    0x00000001

#define _G1CMDH_GCMD23_POSITION                  0x00000007
#define _G1CMDH_GCMD23_MASK                      0x00000080
#define _G1CMDH_GCMD23_LENGTH                    0x00000001

#define _G1CMDH_GCMD24_POSITION                  0x00000008
#define _G1CMDH_GCMD24_MASK                      0x00000100
#define _G1CMDH_GCMD24_LENGTH                    0x00000001

#define _G1CMDH_GCMD25_POSITION                  0x00000009
#define _G1CMDH_GCMD25_MASK                      0x00000200
#define _G1CMDH_GCMD25_LENGTH                    0x00000001

#define _G1CMDH_GCMD26_POSITION                  0x0000000A
#define _G1CMDH_GCMD26_MASK                      0x00000400
#define _G1CMDH_GCMD26_LENGTH                    0x00000001

#define _G1CMDH_GCMD27_POSITION                  0x0000000B
#define _G1CMDH_GCMD27_MASK                      0x00000800
#define _G1CMDH_GCMD27_LENGTH                    0x00000001

#define _G1CMDH_GCMD28_POSITION                  0x0000000C
#define _G1CMDH_GCMD28_MASK                      0x00001000
#define _G1CMDH_GCMD28_LENGTH                    0x00000001

#define _G1CMDH_GCMD29_POSITION                  0x0000000D
#define _G1CMDH_GCMD29_MASK                      0x00002000
#define _G1CMDH_GCMD29_LENGTH                    0x00000001

#define _G1CMDH_GCMD30_POSITION                  0x0000000E
#define _G1CMDH_GCMD30_MASK                      0x00004000
#define _G1CMDH_GCMD30_LENGTH                    0x00000001

#define _G1CMDH_GCMD31_POSITION                  0x0000000F
#define _G1CMDH_GCMD31_MASK                      0x00008000
#define _G1CMDH_GCMD31_LENGTH                    0x00000001

#define _G1CON1_GCMDCNT_POSITION                 0x00000000
#define _G1CON1_GCMDCNT_MASK                     0x0000001F
#define _G1CON1_GCMDCNT_LENGTH                   0x00000005

#define _G1CON1_PUBPP_POSITION                   0x00000005
#define _G1CON1_PUBPP_MASK                       0x000000E0
#define _G1CON1_PUBPP_LENGTH                     0x00000003

#define _G1CON1_GCMDWMK_POSITION                 0x00000008
#define _G1CON1_GCMDWMK_MASK                     0x00001F00
#define _G1CON1_GCMDWMK_LENGTH                   0x00000005

#define _G1CON1_G1SIDL_POSITION                  0x0000000D
#define _G1CON1_G1SIDL_MASK                      0x00002000
#define _G1CON1_G1SIDL_LENGTH                    0x00000001

#define _G1CON1_G1EN_POSITION                    0x0000000F
#define _G1CON1_G1EN_MASK                        0x00008000
#define _G1CON1_G1EN_LENGTH                      0x00000001

#define _G1CON1_GCMDCNT0_POSITION                0x00000000
#define _G1CON1_GCMDCNT0_MASK                    0x00000001
#define _G1CON1_GCMDCNT0_LENGTH                  0x00000001

#define _G1CON1_GCMDCNT1_POSITION                0x00000001
#define _G1CON1_GCMDCNT1_MASK                    0x00000002
#define _G1CON1_GCMDCNT1_LENGTH                  0x00000001

#define _G1CON1_GCMDCNT2_POSITION                0x00000002
#define _G1CON1_GCMDCNT2_MASK                    0x00000004
#define _G1CON1_GCMDCNT2_LENGTH                  0x00000001

